"""ثابت‌های سراسری ماژول"""

# بازه یونیکد حروف فارسی/عربی
PERSIAN_LETTERS = "\u0600-\u06FF\uFB50-\uFDFF\uFE70-\uFEFF"

# کاراکترهای عربی که باید به معادل فارسی تبدیل شوند
ARABIC_TO_PERSIAN_MAP = {
    # ی
    "ي": "ی", # ی عربی
    "ى": "ی", # الف مقصوره
    "ئ": "ی", # همزه بالای ی

    # و
    "ؤ": "و", # همزه بالای و

    # ک
    "ك": "ک", # عادی
    "ﻙ": "ک", # Isolated form

    # ه
    "ۀ": "ه", # همزه روی ه
    "ة": "ه", # ت مربوطه
    "ۃ": "ه", # Teh Marbuta Goal

    # ا
    "ٱ": "ا", # الف وصله
    'إ': 'ا', # همزه زیر الف
    'أ': 'ا', # همزه روی الف

    'ء': '' # همزه تنها (معمولا حذف می‌ شود)
}

# اعداد فارسی/عربی + جداکننده‌ ها
DIGITS_SOURCE = "۰۱۲۳۴۵۶۷۸۹٠١٢٣٤٥٦٧٨٩٫٬"
DIGITS_TARGET = "01234567890123456789.."