# Building Blocks - قطعات پایه

# یک بلوک هگز : 1 تا 4 رقم هگز
_HEX = r"[0-9A-Fa-f]{1,4}"
# ⮡ _variable هیچ محدودیت فنی برای متغیر ایجاد نمی کند و فقط یک قرارداد نانوشته بین برنامه نویسان است که می گوید:
# دسترسی به متغیر موردنظر خارج از کلاس یا ماژول غیرمجاز است
# همچنین این قطعات پایه constant(ثابت) هستند

# یک اکتت IPv4: 0 تا 255
_OCTET = r"(?:25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)"

# ls32: دو بلوک هگز یا یک IPv4 کامل
_LS32 = rf"(?:{_HEX}:{_HEX}|(?:{_OCTET}\.){{3}}{_OCTET})"

# Zone ID (RFC 6874) — بعد از %25 می‌آید
_ZONE_ID = r"(?:%25[A-Za-z0-9._~!\$&'()*+,;=:@/-]+)?"


#  IPv6 Literal - مطابق دقیق RFC 3986

# ⮡ اگر بخواهیم به زبان فنی بگوییم که RFC چیست, باید آن را مجموعه‌ ای از اسناد توصیفی و فنی بدانیم که استاندارد های اصلی اینترنت را تعریف می‌کنند. 

_IPV6_INNER = rf"""
    # Form 1: 6 hex + ls32   (یک ipv6 کامل یا یک ipv4-mapped ipv6)
    (?:{_HEX}:){{6}}{_LS32}
    |
    # Form 2: :: + 5 hex + ls32 (Front-Compressed)
    ::(?:{_HEX}:){{5}}{_LS32}
    |
    # Form 3: h16 + :: + 4 hex + ls32 ()
    { _HEX }::(?:{_HEX}:){{4}}{_LS32}
    |
    # Form 4: [1 hex] + :: + 3 hex + ls32
    (?:{_HEX}:){{0,1}}{_HEX}::(?:{_HEX}:){{3}}{_LS32}
    |
    # Form 5: [2 hex] + :: + 2 hex + ls32
    (?:{_HEX}:){{0,2}}{_HEX}::(?:{_HEX}:){{2}}{_LS32}
    |
    # Form 6: [3 hex] + :: + 1 hex + ls32
    (?:{_HEX}:){{0,3}}{_HEX}::{_HEX}:{_LS32}
    |
    # Form 7: [4 hex] + :: + ls32
    (?:{_HEX}:){{0,4}}{_HEX}::{_LS32}

    # فرم های 3 تا 7 فرم Middle Double Colon

    |
    # Form 8: [5 hex] + :: + h16 (Trailing Double Colon)
    (?:{_HEX}:){{0,5}}{_HEX}::{_HEX}
    |
    # Form 9: [6 hex] + ::  (Trailing Double Colon (خالی))
    (?:{_HEX}:){{0,6}}{_HEX}::
    |
    # Form 10 : Unspecified
    ::
"""

# الگوی کامل IPv6 به همراه براکت‌ها
IPV6_LITERAL = rf"""
(?P<ipv6>
    \[                           # کروشه باز
    (?:{_IPV6_INNER.strip()})    # 9 فرم مختلف
    {_ZONE_ID}                   # Zone ID اختیاری
    \]                           # کروشه بسته
)
"""

# ⮡ کامنت هایی که در raw string بالا نوشتیم به عنوان regex تفسیر نمی شوند زیرا ما بعدا VERBOSE FLAG رو فعال می کنیم.