"""تمام الگو های regex به‌ صورت pre-compiled"""

import re # برای ساخت الگو های ایمیل و URL
from .constants import PERSIAN_LETTERS
from .ipv6_pattern import IPV6_LITERAL
from .tag_pattern import TAG_PATTERN

# الگوی های اصلی

# توضیحات قبل از ورود به کد برای regex:
# انواع گروه ها عبارت اند از:
#     1. Capturing group (گروه ساده و معمولی)
#     2. Non-Capturing group (گروهی که اگر با چیزی match شد یا نشد در خروجی ذخیره نمی شود یعنی در findall یا group معلوم نمی شود) (مزیتش اینه که سریع تر از گروه عادیه و برا وقتیه که می خوایم فقط ببینیم با الگو مطابقت داره یا نه)
#     3. Named Capturing group (همون گروه معمولی هست ولی دارای یک اسم است) (مزیتش اینه که وقتی رجکس خیلی یلند شد بتوانیم ببینیم مثلا آیا در متن fragment یافت شد یا نه و اگر یافت شد اون چی بود)

URL_PATTERN = re.compile(
    r"""
    (?P<scheme> # Named capturing group با اسم scheme
        [a-z] # شروع با حروف بزرگ و کوچک انگلیسی
        [a-z0-9+.\-]* # ادامه‌ی مجاز scheme که می تواند شامل حروف بزرگ و کوچک و اعداد انگلیسی و علامت های +.- باشد
    ):// # جدا کننده scheme که آن را با دامنه جدا می کند

    (?: # Non capturing group : در خروجی ذخیره نمی شود
        (?P<userinfo> # Named capturing group با اسم userinfo
            [^\s:@/?#]+ # username که نباید شامل whitespace و نماد هایی مثل :@/?# باشه
            (?: # Non capturing group : در خروجی ذخیره نمی شود
                :[^\s@/?#]+ # :password اختیاری است و نباید شامل چیز هایی که در بالا گفتیم باشه
            )? # اختیاری
        )
        @ # at sign : جداکننده userinfo با دامنه
    )? # userinfo اختیاری

    (?: # Non capturing group : در خروجی ذخیره نمی شود
        (?P<ipv4> # Named capturing group با اسم ipv4
            (?: # Non capturing group : در خروجی ذخیره نمی شود
                # توضیحات هر بخش جدا شده با عملگر منطقی OR(|):
                25[0-5] #       بخش اول : اول عدد 25 آمده باشه بعدش هم یک عددی که بین 0 تا 5 هست آمده باشه
                |2[0-4]\d #     بخش دوم : اول عدد 2 آمده باشه بعد هم عددی بین 0 تا 4 آمده یاشه بعد هم یک عدد بین 0 تا 9 آمده باشه
                |1\d{2} #       بخش سوم : اول عدد 1 آمده باشه بعد هم یک عدد که شامل دو رقم که می تواند شامل صفر باشد آمده باشه
                |[1-9]?\d #       بخش چهارم : اول یک عدد از 1 تا 9 باشه یا می تونه نباشه بعد هم یک عدد بین 0 تا 9 باشه که یعنی اینکه
            )
            (?: # Non capturing group : در خروجی ذخیره نمی شود
                \. # نقطه که جداکننده Octet های ipv4 است
                (?: # Non capturing group : در خروجی ذخیره نمی شود
                    # این بخش هم مثل Octet اول می باشد
                    25[0-5]|
                    2[0-4]\d
                    |1\d{2}
                    |[1-9]?\d
                )
            ){3} # این نقطه .Octet ها باید 3 بار تکرار شوند تا یک ipv4 به دست آید.
        )""" + 

        IPV6_LITERAL +

        r"""|(?P<domain> # Named capturing group با اسم domain
            (?: # شروع Non-Capturing Group برای حالت‌های مختلف
                # حالت 1 : Punycode یا ASCII (شروع با xn-- یا حروف انگلیسی)
                (?: # شروع گروه Non-Captured برای یک Label
                    (?:xn--)? # پیش‌ فرض Punycode (اختیاری)
                    (?:
                        [a-z0-9] # شروع با حرف یا رقم
                        (?:[a-z0-9\-]{0,61}[a-z0-9])? # ادامه اختیاری (برای پشتیبانی از طول 1)
                    )
                    (?:\. # نقطه + Label بعدی
                        (?:xn--)?
                        (?:
                            [a-z0-9]
                            (?:[a-z0-9-]{0,61}[a-z0-9])?
                        )
                    )* # صفر یا چند Label میانی
                    \. # نقطه قبل از TLD (اجباری)
                    [a-z]{2,63} # TLD (حروف کوچک، ۲ تا ۶۳ کاراکتر)
                    # برای TLD شاید بگید که چون فلگ IGNORECASE وجود دارد حروف بزرگ هم قبول می شود که درست هم هست و نیاز ما اعتبارسنجی دقیق نیست و می خواهیم هر URL ای دیدیم حذفش کنیم.
                )
            )
        )
    )

    (?: # Non capturing group : در خروجی ذخیره نمی شود
        :(?P<port> # Named capturing group با اسم port
            [0-9]{1,5}
        )
    )?

    (?P<path> # Named capturing group با اسم path
        /[^\s?#]*
    )?

    (?P<query> # Named capturing group با اسم query
        \?[^\s#]*
    )?

    (?P<fragment> # Named capturing group با اسم fragment
        \#[^\s]*
    )?
    """,
    re.IGNORECASE | re.VERBOSE
)

# شاید پیش خودتون فکر کنید در بخش الگو های توکنایزر ما چرا گروه های نامدار داریم و چرا همون گروه های عادی رو استفاده نکردیم؟
# دلیلش اینه که این یکی از قابلیت های توسعه این پروژه به شمار می آید
# چون اگر زمانی بخواهیم به بخش مشخصی از متن برسیم این گروه های نامدار بهتر و سریعتر از گروه های عادی هستند.
# یکی از قابلیت های توسعه دیگر این پروژه این است که در بخش توکنایزر

EMAIL_PATTERN = re.compile(
    r"""
    (?P<local>
        [a-z0-9!#$%&'*+/=?^_`{|}~\-]+ # مجموعه‌ای از کاراکتر های مجاز برای atext که برای ساختن یک Atom در بخش Local-part (قسمت قبل از @) را قبول می‌کند.
        (?:\.[a-z0-9!#$%&'*+/=?^_`{|}~\-]+)* # دنباله‌ای از اجزای dot-atom بعد از اولین Atom
        # دو بخش بالا با هم می شود dot-atom-text
        | # یا به جای بخش بالا بخش پایین باشد
        \"(?:\\[\x00-\x7F]|[^\"\\])*\" # Quoted String
    )
    @ # at sign
    (?P<domain>
        (?:
            [a-z0-9]
            (?:
                [a-z0-9\-]{0,61}[a-z0-9]
            )?\.
        )+
        [a-z]{2,63}
    )
    """,
    re.IGNORECASE | re.VERBOSE
)

EMOJI_PATTERN = re.compile(
    "["
    "\U0001F600-\U0001F64F"
    "\U0001F300-\U0001F5FF"
    "\U0001F680-\U0001F6FF"
    "\U0001F1E0-\U0001F1FF"
    "\U00002700-\U000027BF"
    "\U0001F900-\U0001F9FF"
    "\U00002600-\U000026FF"
    "\U00002B00-\U00002BFF"
    "\U0001FA00-\U0001FA6F"
    "\U0001FA70-\U0001FAFF"
    "]+",
    flags=re.UNICODE
)

# الگو های فارسی‌ سازی

# پیشوند ها: می, نمی, بی (با ZWNJ یا فاصله)
PERSIAN_PREFIX_PATTERN = re.compile(
    r"""
    \b # مرز کلمه که تعیین میکنه نمی, می یا بی خود کلمه باشه و انتهای کلمه دیگری نباشه
    # یعنی باید قبل نمی, می یا بی مرز کلمه باشه
    ( 
        نمی[\u200c\s]? # نمی + فاصله یا نیم فاصله(اختیاری)
        |
        می[\u200c\s]?
        |
        بی[\u200c\s]? 
    )""", 
    re.VERBOSE
)

# پسوند ها: ها, های, تر, ترین, جمع‌ها, ضمایر ملکی
PERSIAN_SUFFIX_PATTERN = re.compile(
    r"([\u200c]?(?:ها|های|هایی|تر|ترین|ای|گان|گانه"
    r"|م|ت|ش|مان|تان|شان|ام|ات|اش|ایم|اید|ایند))"
)

# کاهش حروف تکراری - فقط روی حروف فارسی/لاتین
REPEATED_CHAR_PATTERN = re.compile(
    rf"([{PERSIAN_LETTERS}a-zA-Z])\1{{2,}}" # هر حرفی که سه بار پشت سرهم تکرار شده باشه رو match میکنه
    # نکته : اگر \1 وجود نداشت هر کلمه ای که تعداد حروفش بیشتر یا مساوی 2 باشد match می شود
    # معمولا در NLP دو حرف اشتباه محسوب نمی شود سه تا به بالا اغراق است
)

# الگوهای پاکسازی عمومی
CONTROL_CHARS_PATTERN = re.compile(r"[\x00-\x1F\x7F\uFEFF]") # تمام ASCII Control Characters + اون هایی که قابل چاپ نیستند یعنی DEL و Byte Order Mark یا همان BOM
MULTI_WHITESPACE_PATTERN = re.compile(r"\s+")