import re  # اضافه کردن کتابخانه regular expression برای بخش استفاده از الگو ها در text-cleaning
from typing import List, Tuple, Dict  # اضافه کردن کتابخانه typing برای type annotations
from tokenizer.punctuation_list import punctuation  # اضافه کردن لیستی از تمام علائم نگارشی دنیا

punctuation_set = set(punctuation)  # تبدیل بیست علائم نگارشی به set برای سریعتر شدن جست و جو در آن به دلیل استفاده set از hash table


    # توضیحات قبل از ورود به کد برای regex:
    # انواع گروه ها عبارت اند از:
    #     1. Capturing group (گروه ساده و معمولی)
    #     2. Non-Capturing group (گروهی که اگر با چیزی match شد یا نشد در خروجی ذخیره نمی شود یعنی در findall یا group معلوم نمی شود) (مزیتش اینه که سریع تر از گروه عادیه و برا وقتیه که می خوایم فقط ببینیم با الگو مطابقت داره یا نه)
    #     3. Named Capturing group (همون گروه معمولی هست ولی دارای یک اسم است) (مزیتش اینه که وقتی رجکس خیلی یلند شد بتوانیم ببینیم مثلا آیا در متن fragment یافت شد یا نه و اگر یافت شد اون چی بود)


URL_PATTERN = re.compile( # این تابع یک الگو را به Pattern Object تبدیل می کند که بتوانیم از آن هزار بار و خیلی سریعتر استفاده کنیم
    r"""
        (?P<scheme> # Named capturing group با اسم scheme
            [a-z] # شروع با حروف بزرگ و کوچک انگلیسی
            [a-z0-9+.-]* # ادامه‌ی مجاز scheme که می تواند شامل حروف بزرگ و کوچک و اعداد انگلیسی و علامت های +.- باشد
        ):// # جدا کننده scheme که آن را با دامنه جدا می کند

    (?: # Non capturing group : در خروجی ذخیره نمی شود
        (?P<userinfo> # Named capturing group با اسم userinfo
            [^\s:@/?#]+ # username که نباید شامل whitespace و نماد هایی مثل :@/?# باشه
            (?::[^\s@/?#]+)? # :password اختیاری است و نباید شامل چیز هایی که در بالا گفتیم باشه
        )@ # جداکننده userinfo با دامنه
    )? # userinfo اختیاری

    (?: # Non capturing group
        (?P<ipv4> # Named capturing group با اسم ipv4
            (?:25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d) # توضیحات هر بخش جدا شده با عملگر منطقی OR(|):
            #       بخش اول : اول عدد 25 آمده باشه بعدش هم یک عددی که بین 0 تا 5 هست آمده باشه.
            #       بخش دوم : اول عدد 2 آمده باشه بعد هم عددی بین 0 تا 4 آمده یاشه بعد هم یک عدد بین 0 تا 9 آمده باشه.
            #       بخش سوم : اول عدد 1 آمده باشه بعد هم یک عدد دو رقمی آمده باشه
            #       بخش چهارم : اول یک عدد بین 1 تا 9 باشه یا می تونه نباشه بعد هم یک عدد بین 0 تا 9 باشه که یعنی اینکه ipv4 می تونه با عدد تک رقمی هم شروع بشه
            (?:\.(?:25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)){3} # اول یک نقطه باشه بعدش هم توضیحات مثل بالا بعدش هم این 3 بار تکرار شه
        )
        | # یا
        (?P<ipv6> # Named capturing group با اسم ipv6
            \[ # خود کاراکتر براکت
            (?:(?:[0-9a-fA-F]{1,4}:){7}[0-9a-fA-F]{1,4} # اول یک عدد هگزادسیمال با طول بین 1 تا 4 باشه بعدش هم یک علامت دو نقطه باشه و این 7 بار تکرار بشه بعدش یک عدد هگزادسیمال دیگه با طول بین 1 تا 4 برای پایان کار
            | # یا
             (?:[0-9a-fA-F]{1,4}:){1,7}: # اول یک عدد هگزادسیمال با طول بین 1 تا 4 بعدش هم یک دو نقطه باشه و این هم بین 1 تا 7 بار تکرار بشه و برای پایان کار هم یک دونقطه بیاد
             | # یا
             ::(?:[0-9a-fA-F]{1,4}:){0,6}[0-9a-fA-F]{1,4}) # اول دو تا دونه دو نقطه باشه. بعدش هم یک عدد هگزادسیمال با طول بین 1 تا4 باشه بعدش هم یک دونه دو نقطه باشه و این روند بین 0 تا 6 بار تکرار بشه و پایان کار هم یک عدد هگزادسیمال با طول بین 1 تا 4 بیاد
            \] # خود کاراکتر براکت
        )
        | # یا
        (?P<domain> # Named capturing group با اسم domain
            (?:
                [a-z0-9] # شروع دامنه که می تونه با حروف بزرگ و کوچک و اعداد انگلیسی باشه
                [a-z0-9-]{0,61} # وسط دامنه که مثل بالا است و می تواند شامل علامت dash باشد و تا طول بین 0 تا 61 کاراکتر ادامه داشته باشد.
                [a-z0-9] # انتهای دامنه که مثل همون شروع دامنه است
                \. # خود علامت نقطه
            )+ # این می تونه 1 یا بیشتر بار تکرار بشه
            (?-i:[a-z]{2,63}) # TLD مثل com, org, و ir که فقط می تونه شامل حروف کوچک انگلیسی باشه و تا طول بین 2 تا 63 کاراکتر ادامه داشته باشه.
        )
    )

    (?:: # علامت دو نقطه
        (?P<port> # Named capturing group با اسم port
        [0-9]{1,5}) # پورت : که می تونه یک عدد با طول بین 1 تا 5 باشه
    )? # اختیاری

    (?P<path> # Named capturing group با اسم path
        /[^\s?#]* # path : که اولش یک اسلش و بعدش هم فقط نباید شامل whitespace و ?# باشه
    )? # اختیاری

    (?P<query> # Named capturing group با اسم query
        \?[^\s#]* # query : که باید با علامت سوال سروع بشه و شامل whitespace و هش تگ نباشه
    )? # اختیاری

    (?P<fragment> # Named capturing group با اسم fragment
        \#[^\s]* # fragment : که باید با هش تگ شروع بشه و فقط شامل whitespace نباشه
    )? # اختیاری
    """,
    re.VERBOSE | re.IGNORECASE # IGNORECASE برای نادیده گرفتن بزرگی و کوچکی حروف و VERBOSE برای نوشتن رجکس چند خطی و کامنت گذاشتن داخل آن
)

EMAIL_PATTERN = re.compile(
    r"""
    (?P<local> # بخش local-part
        (?:                             
            [a-z0-9!#$%&'*+/=?^_`{|}~-]+ # می تونه شامل چیز های زیر باشه:
            #       حروف بزرگ و کوچک انگلیسی
            #       اعداد 0 تا 9 انگلیسی
            #       نماد های روی کیبورد
            (?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)* # اول یک نقطه باشه بعدش هم توضیحات مثل بالا و می تونه تعداد تکرارش صفر یا بیشتر باشه
        | # یا
            "(?:
            \\ # علامت اسلش
            [\x00-\x7F] # بازه کاراکتر های اسکی
            | # یا
            [^"\\])*" # هر چیزی غیر از دابل کوتیشن و اسلش
        )
    )
    @ # جداکننده
    (?P<domain> # بخش دامنه
        (?:                             
            [a-z0-9] # شامل حروف بزرگ و کوچک انگلیسی و رقم های 0 تا 9 انگلیسی
            (?:[a-z0-9-]{0,61}[a-z0-9])? # اول (توضیحات مثل بالا) بعد این باید طولش بین 0 تا 61 باشه و  می تونه شامل علامت dash هم بشه و دوباره توضیحات مثل بالا. این بخش کلا (اختیاری) است.
            (?:
            \.[a-z0-9] # اولش یک نقطه باشه بعدش هم یک حرف بزرگ یا کوچک انگلیسی یا رقمی بین 0 تا 9
            (?:[a-z0-9-]{0,61}[a-z0-9])? # توضیحات مثل توضیح بالاتر
            )* # این بخش می تونه طولش 0 یا بیشتر باشه
        )
        \.[a-z]{2,63} # TLD : که اولش باید یک نقطه باشد و فقط می تونه شامل حروف کوچک انگلیسی باشه و طولش باید بین 2 تا 63 باشه
    )
    """,
    re.VERBOSE | re.IGNORECASE
)

HTML_TAG_PATTERN = re.compile(r"<[^>]+>") # باید باleft angle bracket شروع شه و بعدش هر چیزی غیر از right angle bracket باشه و در نهایت با right angle bracket تموم بشه
EMOJI_PATTERN = re.compile(
    "["
    "\U0001F600-\U0001F64F"
    "\U0001F300-\U0001F5FF"
    "\U0001F680-\U0001F6FF"
    "\U0001F1E0-\U0001F1FF"
    "\U00002700-\U000027BF"
    "\U0001F900-\U0001F9FF"
    "\U00002600-\U000026FF"
    "\U00002B00-\U00002BFF"
    "]+",
    flags=re.UNICODE,
)# ساخت الگوی تشخیص ایموجی با استفاده از unicode ranges


def separate_punctuations(text: str) -> str:
    """این تابع قبل و بعد از تمام علائم نگارشی درون متن یک فاصله می گذارد"""
    processed_text = "" # متن پردازش شده
    for character in text: # حلقه زدن روی تک به تک کاراکتر های داخل متن
        if character in punctuation_set: # بررسی کردن اینکه اون کاراکتر  یک علامت نگارشی باشه
            processed_text += f" {character} " # اگر بله اون رو باید یک فاصله قبل و بعدش به متن پردازش شده اضافه می کنیم
        else: # اگر خیر
            processed_text += character # عادی اون را اضافه می کنیم
    return processed_text # برگرداندن متن پردازش شده

def normalize_repeated_chars(text: str) -> str:
    """حروف تکراری پشت سر هم را به یک تا کاهش می‌دهد"""
    return re.sub(r"(.)\1{2,}", r"\1", text)

def normalize_persian_unicode(text: str) -> str:
    text = text.replace("\u0640", "") # حذف tatweel که برای کشیدن حروف استفاده میشه
    text = text.replace("\u200c", "") # حذف ZWNJ یا همون نیم فاصله
    text = text.replace("ئ", "ی")
    text = text.replace("ك", "ک")
    text = text.replace("ي", 'ی')
    text = text.replace("ة", 'ت')
    text = text.replace("ۃ", 'ت')

    return text # برگرداندن متن

def clean_text(text: str) -> str:
    """متن را پاکسازی می‌کند"""
    text = text.lower() # تقریبا بی اثره ولی فکر کنم می تونه حروف نچسبیده رو به چسبیده تبدیل کنه
    text = normalize_persian_unicode(text) # نرمال سازی مخصوص فارسی
    text = HTML_TAG_PATTERN.sub(" ", text) # پاک سازی HTML tag
    text = URL_PATTERN.sub(" ", text) # پاک سازی URL
    text = EMAIL_PATTERN.sub(" ", text) # پاک سازی ایمیل
    text = EMOJI_PATTERN.sub(" ", text) # پاک سازی ایموجی
    text = re.sub(r"\s+", " ", text) # حذف فاصله های اضافی
    text = normalize_repeated_chars(text) # نرمال سازی حروف تکراری پشت سر هم
    return text.strip() # بریدن فاصله ها از دو طرف متن

def tokenize(text: str) -> List[str]:
    """توکنایزر word-level برای فارسی مبتنی بر فاصله و پاک سازی حرفه ای متن قبل از عملیات توکنایز"""
    text = clean_text(text) # پاک سازی متن
    text = separate_punctuations(text) # جدا کردن علائم نگارشی
    tokens = text.split() # توکنایز کردن مبتنی بر فاصله
    return tokens # برگرداندن لیست توکن ها
